wtliu/EtherCAT_LAN9252_TMS320F28379D/library/driverlib/inc/hw_hrpwm.h
//###########################################################################
//
// FILE:    hw_hrpwm.h
//
// TITLE:   Definitions for the HRPWM registers.
//
//###########################################################################
// $TI Release: F2837xD Support Library v3.06.00.00 $
// $Release Date: Mon May 27 06:48:24 CDT 2019 $
// $Copyright:
// Copyright (C) 2013-2019 Texas Instruments Incorporated - http://www.ti.com/
//
// Redistribution and use in source and binary forms, with or without 
// modification, are permitted provided that the following conditions 
// are met:
// 
//   Redistributions of source code must retain the above copyright 
//   notice, this list of conditions and the following disclaimer.
// 
//   Redistributions in binary form must reproduce the above copyright
//   notice, this list of conditions and the following disclaimer in the 
//   documentation and/or other materials provided with the   
//   distribution.
// 
//   Neither the name of Texas Instruments Incorporated nor the names of
//   its contributors may be used to endorse or promote products derived
//   from this software without specific prior written permission.
// 
// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
// "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
// LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
// OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
// SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
// LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
// DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
// THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
// (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
// OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
// $
//###########################################################################

#ifndef HW_HRPWM_H
#define HW_HRPWM_H

//*****************************************************************************
//
// The following are defines for the HRPWM register offsets
//
//*****************************************************************************
#define HRPWM_O_TBCTL             0x0U         // Time Base Control Register
#define HRPWM_O_TBCTL2            0x1U         // Time Base Control Register 2
#define HRPWM_O_TBCTR             0x4U         // Time Base Counter Register
#define HRPWM_O_TBSTS             0x5U         // Time Base Status Register
#define HRPWM_O_CMPCTL            0x8U         // Counter Compare Control
                                               // Register
#define HRPWM_O_CMPCTL2           0x9U         // Counter Compare Control
                                               // Register 2
#define HRPWM_O_DBCTL             0xCU         // Dead-Band Generator Control
                                               // Register
#define HRPWM_O_DBCTL2            0xDU         // Dead-Band Generator Control
                                               // Register 2
#define HRPWM_O_AQCTL             0x10U        // Action Qualifier Control
                                               // Register
#define HRPWM_O_AQTSRCSEL         0x11U        // Action Qualifier Trigger
                                               // Event Source Select Register
#define HRPWM_O_PCCTL             0x14U        // PWM Chopper Control Register
#define HRPWM_O_VCAPCTL           0x18U        // Valley Capture Control
                                               // Register
#define HRPWM_O_VCNTCFG           0x19U        // Valley Counter Config
                                               // Register
#define HRPWM_O_HRCNFG            0x20U        // HRPWM Configuration Register
#define HRPWM_O_HRPWR             0x21U        // HRPWM Power Register
#define HRPWM_O_HRMSTEP           0x26U        // HRPWM MEP Step Register
#define HRPWM_O_HRCNFG2           0x27U        // HRPWM Configuration 2
                                               // Register
#define HRPWM_O_HRPCTL            0x2DU        // High Resolution Period
                                               // Control Register
#define HRPWM_O_TRREM             0x2EU        // Translator High Resolution
                                               // Remainder Register
#define HRPWM_O_GLDCTL            0x34U        // Global PWM Load Control
                                               // Register
#define HRPWM_O_GLDCFG            0x35U        // Global PWM Load Config
                                               // Register
#define HRPWM_O_XLINK             0x38U       // EPWMx Link Register
#define HRPWM_O_EPWMREV           0x3EU        // EPWM Revision Register
#define HRPWM_O_AQCTLA            0x40U        // Action Qualifier Control
                                               // Register For Output A
#define HRPWM_O_AQCTLA2           0x41U        // Additional Action Qualifier
                                               // Control Register For Output A
#define HRPWM_O_AQCTLB            0x42U        // Action Qualifier Control
                                               // Register For Output B
#define HRPWM_O_AQCTLB2           0x43U        // Additional Action Qualifier
                                               // Control Register For Output B
#define HRPWM_O_AQSFRC            0x47U        // Action Qualifier Software
                                               // Force Register
#define HRPWM_O_AQCSFRC           0x49U        // Action Qualifier Continuous
                                               // S/W Force Register
#define HRPWM_O_DBREDHR           0x50U        // Dead-Band Generator Rising
                                               // Edge Delay High Resolution
                                               // Mirror Register
#define HRPWM_O_DBRED             0x51U        // Dead-Band Generator Rising
                                               // Edge Delay High Resolution
                                               // Mirror Register
#define HRPWM_O_DBFEDHR           0x52U        // Dead-Band Generator Falling
                                               // Edge Delay High Resolution
                                               // Register
#define HRPWM_O_DBFED             0x53U        // Dead-Band Generator Falling
                                               // Edge Delay Count Register
#define HRPWM_O_TBPHS             0x60U        // Time Base Phase High
#define HRPWM_O_TBPRDHR           0x62U        // Time Base Period High
                                               // Resolution Register
#define HRPWM_O_TBPRD             0x63U        // Time Base Period Register
#define HRPWM_O_CMPA              0x6AU        // Counter Compare A Register
#define HRPWM_O_CMPB              0x6CU        // Compare B Register
#define HRPWM_O_CMPC              0x6FU        // Counter Compare C Register
#define HRPWM_O_CMPD              0x71U        // Counter Compare D Register
#define HRPWM_O_GLDCTL2           0x74U        // Global PWM Load Control
                                               // Register 2
#define HRPWM_O_SWVDELVAL         0x77U        // Software Valley Mode Delay
                                               // Register
#define HRPWM_O_TZSEL             0x80U        // Trip Zone Select Register
#define HRPWM_O_TZDCSEL           0x82U        // Trip Zone Digital Comparator
                                               // Select Register
#define HRPWM_O_TZCTL             0x84U        // Trip Zone Control Register
#define HRPWM_O_TZCTL2            0x85U        // Additional Trip Zone Control
                                               // Register
#define HRPWM_O_TZCTLDCA          0x86U        // Trip Zone Control Register
                                               // Digital Compare A
#define HRPWM_O_TZCTLDCB          0x87U        // Trip Zone Control Register
                                               // Digital Compare B
#define HRPWM_O_TZEINT            0x8DU        // Trip Zone Enable Interrupt
                                               // Register
#define HRPWM_O_TZFLG             0x93U        // Trip Zone Flag Register
#define HRPWM_O_TZCBCFLG          0x94U        // Trip Zone CBC Flag Register
#define HRPWM_O_TZOSTFLG          0x95U        // Trip Zone OST Flag Register
#define HRPWM_O_TZCLR             0x97U        // Trip Zone Clear Register
#define HRPWM_O_TZCBCCLR          0x98U        // Trip Zone CBC Clear Register
#define HRPWM_O_TZOSTCLR          0x99U        // Trip Zone OST Clear Register
#define HRPWM_O_TZFRC             0x9BU        // Trip Zone Force Register
#define HRPWM_O_ETSEL             0xA4U        // Event Trigger Selection
                                               // Register
#define HRPWM_O_ETPS              0xA6U        // Event Trigger Pre-Scale
                                               // Register
#define HRPWM_O_ETFLG             0xA8U        // Event Trigger Flag Register
#define HRPWM_O_ETCLR             0xAAU        // Event Trigger Clear Register
#define HRPWM_O_ETFRC             0xACU        // Event Trigger Force Register
#define HRPWM_O_ETINTPS           0xAEU        // Event-Trigger Interrupt
                                               // Pre-Scale Register
#define HRPWM_O_ETSOCPS           0xB0U        // Event-Trigger SOC Pre-Scale
                                               // Register
#define HRPWM_O_ETCNTINITCTL      0xB2U        // Event-Trigger Counter
                                               // Initialization Control Register
#define HRPWM_O_ETCNTINIT         0xB4U        // Event-Trigger Counter
                                               // Initialization Register
#define HRPWM_O_DCTRIPSEL         0xC0U        // Digital Compare Trip Select
                                               // Register
#define HRPWM_O_DCACTL            0xC3U        // Digital Compare A Control
                                               // Register
#define HRPWM_O_DCBCTL            0xC4U        // Digital Compare B Control
                                               // Register
#define HRPWM_O_DCFCTL            0xC7U        // Digital Compare Filter
                                               // Control Register
#define HRPWM_O_DCCAPCTL          0xC8U        // Digital Compare Capture
                                               // Control Register
#define HRPWM_O_DCFOFFSET         0xC9U        // Digital Compare Filter Offset
                                               // Register
#define HRPWM_O_DCFOFFSETCNT      0xCAU        // Digital Compare Filter Offset
                                               // Counter Register
#define HRPWM_O_DCFWINDOW         0xCBU        // Digital Compare Filter Window
                                               // Register
#define HRPWM_O_DCFWINDOWCNT      0xCCU        // Digital Compare Filter Window
                                               // Counter Register
#define HRPWM_O_DCCAP             0xCFU        // Digital Compare Counter
                                               // Capture Register
#define HRPWM_O_DCAHTRIPSEL       0xD2U        // Digital Compare AH Trip
                                               // Select
#define HRPWM_O_DCALTRIPSEL       0xD3U        // Digital Compare AL Trip
                                               // Select
#define HRPWM_O_DCBHTRIPSEL       0xD4U        // Digital Compare BH Trip
                                               // Select
#define HRPWM_O_DCBLTRIPSEL       0xD5U        // Digital Compare BL Trip
                                               // Select
#define HRPWM_O_HWVDELVAL         0xFDU        // Hardware Valley Mode Delay
                                               // Register
#define HRPWM_O_VCNTVAL           0xFEU        // Hardware Valley Counter
                                               // Register

//*****************************************************************************
//
// The following are defines for the bit fields in the TBCTL register
//
//*****************************************************************************
#define HRPWM_TBCTL_CTRMODE_S     0U
#define HRPWM_TBCTL_CTRMODE_M     0x3U         // Counter Mode
#define HRPWM_TBCTL_PHSEN         0x4U         // Phase Load Enable
#define HRPWM_TBCTL_PRDLD         0x8U         // Active Period Load
#define HRPWM_TBCTL_SYNCOSEL_S    4U
#define HRPWM_TBCTL_SYNCOSEL_M    0x30U        // Sync Output Select
#define HRPWM_TBCTL_SWFSYNC       0x40U        // Software Force Sync Pulse
#define HRPWM_TBCTL_HSPCLKDIV_S   7U
#define HRPWM_TBCTL_HSPCLKDIV_M   0x380U       // High Speed TBCLK Pre-scaler
#define HRPWM_TBCTL_CLKDIV_S      10U
#define HRPWM_TBCTL_CLKDIV_M      0x1C00U      // Time Base Clock Pre-scaler
#define HRPWM_TBCTL_PHSDIR        0x2000U      // Phase Direction Bit
#define HRPWM_TBCTL_FREE_SOFT_S   14U
#define HRPWM_TBCTL_FREE_SOFT_M   0xC000U      // Emulation Mode Bits

//*****************************************************************************
//
// The following are defines for the bit fields in the TBCTL2 register
//
//*****************************************************************************
#define HRPWM_TBCTL2_OSHTSYNCMODE  0x40U        // One shot sync mode
#define HRPWM_TBCTL2_OSHTSYNC     0x80U        // One shot sync
#define HRPWM_TBCTL2_SYNCOSELX_S  12U
#define HRPWM_TBCTL2_SYNCOSELX_M  0x3000U      // Syncout selection
#define HRPWM_TBCTL2_PRDLDSYNC_S  14U
#define HRPWM_TBCTL2_PRDLDSYNC_M  0xC000U      // PRD Shadow to Active Load on
                                               // SYNC Event

//*****************************************************************************
//
// The following are defines for the bit fields in the TBSTS register
//
//*****************************************************************************
#define HRPWM_TBSTS_CTRDIR        0x1U         // Counter Direction Status
#define HRPWM_TBSTS_SYNCI         0x2U         // External Input Sync Status
#define HRPWM_TBSTS_CTRMAX        0x4U         // Counter Max Latched Status

//*****************************************************************************
//
// The following are defines for the bit fields in the CMPCTL register
//
//*****************************************************************************
#define HRPWM_CMPCTL_LOADAMODE_S  0U
#define HRPWM_CMPCTL_LOADAMODE_M  0x3U         // Active Compare A Load
#define HRPWM_CMPCTL_LOADBMODE_S  2U
#define HRPWM_CMPCTL_LOADBMODE_M  0xCU         // Active Compare B Load
#define HRPWM_CMPCTL_SHDWAMODE    0x10U        // Compare A Register Block
                                               // Operating Mode
#define HRPWM_CMPCTL_SHDWBMODE    0x40U        // Compare B Register Block
                                               // Operating Mode
#define HRPWM_CMPCTL_SHDWAFULL    0x100U       // Compare A Shadow Register
                                               // Full Status
#define HRPWM_CMPCTL_SHDWBFULL    0x200U       // Compare B Shadow Register
                                               // Full Status
#define HRPWM_CMPCTL_LOADASYNC_S  10U
#define HRPWM_CMPCTL_LOADASYNC_M  0xC00U       // Active Compare A Load on SYNC
#define HRPWM_CMPCTL_LOADBSYNC_S  12U
#define HRPWM_CMPCTL_LOADBSYNC_M  0x3000U      // Active Compare B Load on SYNC

//*****************************************************************************
//
// The following are defines for the bit fields in the CMPCTL2 register
//
//*****************************************************************************
#define HRPWM_CMPCTL2_LOADCMODE_S  0U
#define HRPWM_CMPCTL2_LOADCMODE_M  0x3U         // Active Compare C Load
#define HRPWM_CMPCTL2_LOADDMODE_S  2U
#define HRPWM_CMPCTL2_LOADDMODE_M  0xCU         // Active Compare D load
#define HRPWM_CMPCTL2_SHDWCMODE   0x10U        // Compare C Block Operating
                                               // Mode
#define HRPWM_CMPCTL2_SHDWDMODE   0x40U        // Compare D Block Operating
                                               // Mode
#define HRPWM_CMPCTL2_LOADCSYNC_S  10U
#define HRPWM_CMPCTL2_LOADCSYNC_M  0xC00U       // Active Compare C Load on SYNC
#define HRPWM_CMPCTL2_LOADDSYNC_S  12U
#define HRPWM_CMPCTL2_LOADDSYNC_M  0x3000U      // Active Compare D Load on SYNC

//*****************************************************************************
//
// The following are defines for the bit fields in the DBCTL register
//
//*****************************************************************************
#define HRPWM_DBCTL_OUT_MODE_S    0U
#define HRPWM_DBCTL_OUT_MODE_M    0x3U         // Dead Band Output Mode Control
#define HRPWM_DBCTL_POLSEL_S      2U
#define HRPWM_DBCTL_POLSEL_M      0xCU         // Polarity Select Control
#define HRPWM_DBCTL_IN_MODE_S     4U
#define HRPWM_DBCTL_IN_MODE_M     0x30U        // Dead Band Input Select Mode
                                               // Control
#define HRPWM_DBCTL_LOADREDMODE_S  6U
#define HRPWM_DBCTL_LOADREDMODE_M  0xC0U        // Active DBRED Load Mode
#define HRPWM_DBCTL_LOADFEDMODE_S  8U
#define HRPWM_DBCTL_LOADFEDMODE_M  0x300U       // Active DBFED Load Mode
#define HRPWM_DBCTL_SHDWDBREDMODE  0x400U       // DBRED Block Operating Mode
#define HRPWM_DBCTL_SHDWDBFEDMODE  0x800U       // DBFED Block Operating Mode
#define HRPWM_DBCTL_OUTSWAP_S     12U
#define HRPWM_DBCTL_OUTSWAP_M     0x3000U      // Dead Band Output Swap Control
#define HRPWM_DBCTL_DEDB_MODE     0x4000U      // Dead Band Dual-Edge B Mode
                                               // Control
#define HRPWM_DBCTL_HALFCYCLE     0x8000U      // Half Cycle Clocking Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the DBCTL2 register
//
//*****************************************************************************
#define HRPWM_DBCTL2_LOADDBCTLMODE_S  0U
#define HRPWM_DBCTL2_LOADDBCTLMODE_M  0x3U         // DBCTL Load from Shadow Mode
                                               // Select
#define HRPWM_DBCTL2_SHDWDBCTLMODE  0x4U         // DBCTL Load mode Select

//*****************************************************************************
//
// The following are defines for the bit fields in the AQCTL register
//
//*****************************************************************************
#define HRPWM_AQCTL_LDAQAMODE_S   0U
#define HRPWM_AQCTL_LDAQAMODE_M   0x3U         // Action Qualifier A Load
                                               // Select
#define HRPWM_AQCTL_LDAQBMODE_S   2U
#define HRPWM_AQCTL_LDAQBMODE_M   0xCU         // Action Qualifier B Load
                                               // Select
#define HRPWM_AQCTL_SHDWAQAMODE   0x10U        // Action Qualifer A Operating
                                               // Mode
#define HRPWM_AQCTL_SHDWAQBMODE   0x40U        // Action Qualifier B Operating
                                               // Mode
#define HRPWM_AQCTL_LDAQASYNC_S   8U
#define HRPWM_AQCTL_LDAQASYNC_M   0x300U       // AQCTLA Register Load on SYNC
#define HRPWM_AQCTL_LDAQBSYNC_S   10U
#define HRPWM_AQCTL_LDAQBSYNC_M   0xC00U       // AQCTLB Register Load on SYNC

//*****************************************************************************
//
// The following are defines for the bit fields in the AQTSRCSEL register
//
//*****************************************************************************
#define HRPWM_AQTSRCSEL_T1SEL_S   0U
#define HRPWM_AQTSRCSEL_T1SEL_M   0xFU         // T1 Event Source Select Bits
#define HRPWM_AQTSRCSEL_T2SEL_S   4U
#define HRPWM_AQTSRCSEL_T2SEL_M   0xF0U        // T2 Event Source Select Bits

//*****************************************************************************
//
// The following are defines for the bit fields in the PCCTL register
//
//*****************************************************************************
#define HRPWM_PCCTL_CHPEN         0x1U         // PWM chopping enable
#define HRPWM_PCCTL_OSHTWTH_S     1U
#define HRPWM_PCCTL_OSHTWTH_M     0x1EU        // One-shot pulse width
#define HRPWM_PCCTL_CHPFREQ_S     5U
#define HRPWM_PCCTL_CHPFREQ_M     0xE0U        // Chopping clock frequency
#define HRPWM_PCCTL_CHPDUTY_S     8U
#define HRPWM_PCCTL_CHPDUTY_M     0x700U       // Chopping clock Duty cycle

//*****************************************************************************
//
// The following are defines for the bit fields in the VCAPCTL register
//
//*****************************************************************************
#define HRPWM_VCAPCTL_VCAPE       0x1U         // Valley  Capture mode
#define HRPWM_VCAPCTL_VCAPSTART   0x2U         // Valley  Capture Start
#define HRPWM_VCAPCTL_TRIGSEL_S   2U
#define HRPWM_VCAPCTL_TRIGSEL_M   0x1CU        // Capture Trigger Select
#define HRPWM_VCAPCTL_VDELAYDIV_S  7U
#define HRPWM_VCAPCTL_VDELAYDIV_M  0x380U       // Valley Delay Mode Divide
                                               // Enable
#define HRPWM_VCAPCTL_EDGEFILTDLYSEL  0x400U       // Valley Switching Mode Delay
                                               // Select

//*****************************************************************************
//
// The following are defines for the bit fields in the VCNTCFG register
//
//*****************************************************************************
#define HRPWM_VCNTCFG_STARTEDGE_S  0U
#define HRPWM_VCNTCFG_STARTEDGE_M  0xFU         // Counter Start Edge Selection
#define HRPWM_VCNTCFG_STARTEDGESTS  0x80U        // Start Edge Status Bit
#define HRPWM_VCNTCFG_STOPEDGE_S  8U
#define HRPWM_VCNTCFG_STOPEDGE_M  0xF00U       // Counter Start Edge Selection
#define HRPWM_VCNTCFG_STOPEDGESTS  0x8000U      // Stop Edge Status Bit

//*****************************************************************************
//
// The following are defines for the bit fields in the HRCNFG register
//
//*****************************************************************************
#define HRPWM_HRCNFG_EDGMODE_S    0U
#define HRPWM_HRCNFG_EDGMODE_M    0x3U         // ePWMxA Edge Mode Select Bits
#define HRPWM_HRCNFG_CTLMODE      0x4U         // ePWMxA Control Mode Select
                                               // Bits
#define HRPWM_HRCNFG_HRLOAD_S     3U
#define HRPWM_HRCNFG_HRLOAD_M     0x18U        // ePWMxA Shadow Mode Select
                                               // Bits
#define HRPWM_HRCNFG_SELOUTB      0x20U        // EPWMB Output Selection Bit
#define HRPWM_HRCNFG_AUTOCONV     0x40U        // Autoconversion Bit
#define HRPWM_HRCNFG_SWAPAB       0x80U        // Swap EPWMA and EPWMB Outputs
                                               // Bit
#define HRPWM_HRCNFG_EDGMODEB_S   8U
#define HRPWM_HRCNFG_EDGMODEB_M   0x300U       // ePWMxB Edge Mode Select Bits
#define HRPWM_HRCNFG_CTLMODEB     0x400U       // ePWMxB Control Mode Select
                                               // Bits
#define HRPWM_HRCNFG_HRLOADB_S    11U
#define HRPWM_HRCNFG_HRLOADB_M    0x1800U      // ePWMxB Shadow Mode Select
                                               // Bits

//*****************************************************************************
//
// The following are defines for the bit fields in the HRPWR register
//
//*****************************************************************************
#define HRPWM_HRPWR_CALPWRON      0x8000U      // Calibration Power On

