wtliu/EtherCAT_LAN9252_TMS320F28379D/library/driverlib/inc/hw_hrpwm.h
//*****************************************************************************
//
// The following are defines for the bit fields in the TZCBCFLG register
//
//*****************************************************************************
#define HRPWM_TZCBCFLG_CBC1       0x1U         // Latched Status Flag for CBC1
                                               // Trip Latch
#define HRPWM_TZCBCFLG_CBC2       0x2U         // Latched Status Flag for CBC2
                                               // Trip Latch
#define HRPWM_TZCBCFLG_CBC3       0x4U         // Latched Status Flag for CBC3
                                               // Trip Latch
#define HRPWM_TZCBCFLG_CBC4       0x8U         // Latched Status Flag for CBC4
                                               // Trip Latch
#define HRPWM_TZCBCFLG_CBC5       0x10U        // Latched Status Flag for CBC5
                                               // Trip Latch
#define HRPWM_TZCBCFLG_CBC6       0x20U        // Latched Status Flag for CBC6
                                               // Trip Latch
#define HRPWM_TZCBCFLG_DCAEVT2    0x40U        // Latched Status Flag for
                                               // Digital Compare Output A Event 2
#define HRPWM_TZCBCFLG_DCBEVT2    0x80U        // Latched Status Flag for
                                               // Digital Compare Output B Event 2

//*****************************************************************************
//
// The following are defines for the bit fields in the TZOSTFLG register
//
//*****************************************************************************
#define HRPWM_TZOSTFLG_OST1       0x1U         // Latched Status Flag for OST1
                                               // Trip Latch
#define HRPWM_TZOSTFLG_OST2       0x2U         // Latched Status Flag for OST2
                                               // Trip Latch
#define HRPWM_TZOSTFLG_OST3       0x4U         // Latched Status Flag for OST3
                                               // Trip Latch
#define HRPWM_TZOSTFLG_OST4       0x8U         // Latched Status Flag for OST4
                                               // Trip Latch
#define HRPWM_TZOSTFLG_OST5       0x10U        // Latched Status Flag for OST5
                                               // Trip Latch
#define HRPWM_TZOSTFLG_OST6       0x20U        // Latched Status Flag for OST6
                                               // Trip Latch
#define HRPWM_TZOSTFLG_DCAEVT1    0x40U        // Latched Status Flag for
                                               // Digital Compare Output A Event 1
#define HRPWM_TZOSTFLG_DCBEVT1    0x80U        // Latched Status Flag for
                                               // Digital Compare Output B Event 1

//*****************************************************************************
//
// The following are defines for the bit fields in the TZCLR register
//
//*****************************************************************************
#define HRPWM_TZCLR_INT           0x1U         // Global Interrupt Clear Flag
#define HRPWM_TZCLR_CBC           0x2U         // Cycle-By-Cycle Flag Clear
#define HRPWM_TZCLR_OST           0x4U         // One-Shot Flag Clear
#define HRPWM_TZCLR_DCAEVT1       0x8U         // DCAVET1 Flag Clear
#define HRPWM_TZCLR_DCAEVT2       0x10U        // DCAEVT2 Flag Clear
#define HRPWM_TZCLR_DCBEVT1       0x20U        // DCBEVT1 Flag Clear
#define HRPWM_TZCLR_DCBEVT2       0x40U        // DCBEVT2 Flag Clear
#define HRPWM_TZCLR_CBCPULSE_S    14U
#define HRPWM_TZCLR_CBCPULSE_M    0xC000U      // Clear Pulse for CBC Trip
                                               // Latch

//*****************************************************************************
//
// The following are defines for the bit fields in the TZCBCCLR register
//
//*****************************************************************************
#define HRPWM_TZCBCCLR_CBC1       0x1U         // Clear Flag for Cycle-By-Cycle
                                               // (CBC1) Trip Latch
#define HRPWM_TZCBCCLR_CBC2       0x2U         // Clear Flag for Cycle-By-Cycle
                                               // (CBC2) Trip Latch
#define HRPWM_TZCBCCLR_CBC3       0x4U         // Clear Flag for Cycle-By-Cycle
                                               // (CBC3) Trip Latch
#define HRPWM_TZCBCCLR_CBC4       0x8U         // Clear Flag for Cycle-By-Cycle
                                               // (CBC4) Trip Latch
#define HRPWM_TZCBCCLR_CBC5       0x10U        // Clear Flag for Cycle-By-Cycle
                                               // (CBC5) Trip Latch
#define HRPWM_TZCBCCLR_CBC6       0x20U        // Clear Flag for Cycle-By-Cycle
                                               // (CBC6) Trip Latch
#define HRPWM_TZCBCCLR_DCAEVT2    0x40U        // Clear Flag forDCAEVT2
                                               // selected for CBC
#define HRPWM_TZCBCCLR_DCBEVT2    0x80U        // Clear Flag for DCBEVT2
                                               // selected for CBC

//*****************************************************************************
//
// The following are defines for the bit fields in the TZOSTCLR register
//
//*****************************************************************************
#define HRPWM_TZOSTCLR_OST1       0x1U         // Clear Flag for Oneshot (OST1)
                                               // Trip Latch
#define HRPWM_TZOSTCLR_OST2       0x2U         // Clear Flag for Oneshot (OST2)
                                               // Trip Latch
#define HRPWM_TZOSTCLR_OST3       0x4U         // Clear Flag for Oneshot (OST3)
                                               // Trip Latch
#define HRPWM_TZOSTCLR_OST4       0x8U         // Clear Flag for Oneshot (OST4)
                                               // Trip Latch
#define HRPWM_TZOSTCLR_OST5       0x10U        // Clear Flag for Oneshot (OST5)
                                               // Trip Latch
#define HRPWM_TZOSTCLR_OST6       0x20U        // Clear Flag for Oneshot (OST6)
                                               // Trip Latch
#define HRPWM_TZOSTCLR_DCAEVT1    0x40U        // Clear Flag for DCAEVT1
                                               // selected for OST
#define HRPWM_TZOSTCLR_DCBEVT1    0x80U        // Clear Flag for DCBEVT1
                                               // selected for OST

//*****************************************************************************
//
// The following are defines for the bit fields in the TZFRC register
//
//*****************************************************************************
#define HRPWM_TZFRC_CBC           0x2U         // Force Trip Zones Cycle By
                                               // Cycle Event
#define HRPWM_TZFRC_OST           0x4U         // Force Trip Zones One Shot
                                               // Event
#define HRPWM_TZFRC_DCAEVT1       0x8U         // Force Digital Compare A Event
                                               // 1
#define HRPWM_TZFRC_DCAEVT2       0x10U        // Force Digital Compare A Event
                                               // 2
#define HRPWM_TZFRC_DCBEVT1       0x20U        // Force Digital Compare B Event
                                               // 1
#define HRPWM_TZFRC_DCBEVT2       0x40U        // Force Digital Compare B Event
                                               // 2

//*****************************************************************************
//
// The following are defines for the bit fields in the ETSEL register
//
//*****************************************************************************
#define HRPWM_ETSEL_INTSEL_S      0U
#define HRPWM_ETSEL_INTSEL_M      0x7U         // EPWMxINTn Select
#define HRPWM_ETSEL_INTEN         0x8U         // EPWMxINTn Enable
#define HRPWM_ETSEL_SOCASELCMP    0x10U        // EPWMxSOCA Compare Select
#define HRPWM_ETSEL_SOCBSELCMP    0x20U        // EPWMxSOCB Compare Select
#define HRPWM_ETSEL_INTSELCMP     0x40U        // EPWMxINT Compare Select
#define HRPWM_ETSEL_SOCASEL_S     8U
#define HRPWM_ETSEL_SOCASEL_M     0x700U       // Start of Conversion A Select
#define HRPWM_ETSEL_SOCAEN        0x800U       // Start of Conversion A Enable
#define HRPWM_ETSEL_SOCBSEL_S     12U
#define HRPWM_ETSEL_SOCBSEL_M     0x7000U      // Start of Conversion B Select
#define HRPWM_ETSEL_SOCBEN        0x8000U      // Start of Conversion B Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the ETPS register
//
//*****************************************************************************
#define HRPWM_ETPS_INTPRD_S       0U
#define HRPWM_ETPS_INTPRD_M       0x3U         // EPWMxINTn Period Select
#define HRPWM_ETPS_INTCNT_S       2U
#define HRPWM_ETPS_INTCNT_M       0xCU         // EPWMxINTn Counter Register
#define HRPWM_ETPS_INTPSSEL       0x10U        // EPWMxINTn Pre-Scale Selection
                                               // Bits
#define HRPWM_ETPS_SOCPSSEL       0x20U        // EPWMxSOC A/B  Pre-Scale
                                               // Selection Bits
#define HRPWM_ETPS_SOCAPRD_S      8U
#define HRPWM_ETPS_SOCAPRD_M      0x300U       // EPWMxSOCA Period Select
#define HRPWM_ETPS_SOCACNT_S      10U
#define HRPWM_ETPS_SOCACNT_M      0xC00U       // EPWMxSOCA Counter Register
#define HRPWM_ETPS_SOCBPRD_S      12U
#define HRPWM_ETPS_SOCBPRD_M      0x3000U      // EPWMxSOCB Period Select
#define HRPWM_ETPS_SOCBCNT_S      14U
#define HRPWM_ETPS_SOCBCNT_M      0xC000U      // EPWMxSOCB Counter

//*****************************************************************************
//
// The following are defines for the bit fields in the ETFLG register
//
//*****************************************************************************
#define HRPWM_ETFLG_INT           0x1U         // EPWMxINTn Flag
#define HRPWM_ETFLG_SOCA          0x4U         // EPWMxSOCA Flag
#define HRPWM_ETFLG_SOCB          0x8U         // EPWMxSOCB Flag

//*****************************************************************************
//
// The following are defines for the bit fields in the ETCLR register
//
//*****************************************************************************
#define HRPWM_ETCLR_INT           0x1U         // EPWMxINTn Clear
#define HRPWM_ETCLR_SOCA          0x4U         // EPWMxSOCA Clear
#define HRPWM_ETCLR_SOCB          0x8U         // EPWMxSOCB Clear

//*****************************************************************************
//
// The following are defines for the bit fields in the ETFRC register
//
//*****************************************************************************
#define HRPWM_ETFRC_INT           0x1U         // EPWMxINTn Force
#define HRPWM_ETFRC_SOCA          0x4U         // EPWMxSOCA Force
#define HRPWM_ETFRC_SOCB          0x8U         // EPWMxSOCB Force

//*****************************************************************************
//
// The following are defines for the bit fields in the ETINTPS register
//
//*****************************************************************************
#define HRPWM_ETINTPS_INTPRD2_S   0U
#define HRPWM_ETINTPS_INTPRD2_M   0xFU         // EPWMxINTn Period Select
#define HRPWM_ETINTPS_INTCNT2_S   4U
#define HRPWM_ETINTPS_INTCNT2_M   0xF0U        // EPWMxINTn Counter Register

//*****************************************************************************
//
// The following are defines for the bit fields in the ETSOCPS register
//
//*****************************************************************************
#define HRPWM_ETSOCPS_SOCAPRD2_S  0U
#define HRPWM_ETSOCPS_SOCAPRD2_M  0xFU         // EPWMxSOCA Period Select
#define HRPWM_ETSOCPS_SOCACNT2_S  4U
#define HRPWM_ETSOCPS_SOCACNT2_M  0xF0U        // EPWMxSOCA Counter Register
#define HRPWM_ETSOCPS_SOCBPRD2_S  8U
#define HRPWM_ETSOCPS_SOCBPRD2_M  0xF00U       // EPWMxSOCB Period Select
#define HRPWM_ETSOCPS_SOCBCNT2_S  12U
#define HRPWM_ETSOCPS_SOCBCNT2_M  0xF000U      // EPWMxSOCB Counter Register

//*****************************************************************************
//
// The following are defines for the bit fields in the ETCNTINITCTL register
//
//*****************************************************************************
#define HRPWM_ETCNTINITCTL_INTINITFRC  0x400U       // EPWMxINT Counter
                                               // Initialization Force
#define HRPWM_ETCNTINITCTL_SOCAINITFRC  0x800U       // EPWMxSOCA Counter
                                               // Initialization Force
#define HRPWM_ETCNTINITCTL_SOCBINITFRC  0x1000U      // EPWMxSOCB Counter
                                               // Initialization Force
#define HRPWM_ETCNTINITCTL_INTINITEN  0x2000U      // EPWMxINT Counter
                                               // Initialization Enable
#define HRPWM_ETCNTINITCTL_SOCAINITEN  0x4000U      // EPWMxSOCA Counter
                                               // Initialization Enable
#define HRPWM_ETCNTINITCTL_SOCBINITEN  0x8000U      // EPWMxSOCB Counter
                                               // Initialization Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the ETCNTINIT register
//
//*****************************************************************************
#define HRPWM_ETCNTINIT_INTINIT_S  0U
#define HRPWM_ETCNTINIT_INTINIT_M  0xFU         // EPWMxINT Counter
                                               // Initialization Bits
#define HRPWM_ETCNTINIT_SOCAINIT_S  4U
#define HRPWM_ETCNTINIT_SOCAINIT_M  0xF0U        // EPWMxSOCA Counter
                                               // Initialization Bits
#define HRPWM_ETCNTINIT_SOCBINIT_S  8U
#define HRPWM_ETCNTINIT_SOCBINIT_M  0xF00U       // EPWMxSOCB Counter
                                               // Initialization Bits

//*****************************************************************************
//
// The following are defines for the bit fields in the DCTRIPSEL register
//
//*****************************************************************************
#define HRPWM_DCTRIPSEL_DCAHCOMPSEL_S  0U
#define HRPWM_DCTRIPSEL_DCAHCOMPSEL_M  0xFU         // Digital Compare A High COMP
                                               // Input Select
#define HRPWM_DCTRIPSEL_DCALCOMPSEL_S  4U
#define HRPWM_DCTRIPSEL_DCALCOMPSEL_M  0xF0U        // Digital Compare A Low COMP
                                               // Input Select
#define HRPWM_DCTRIPSEL_DCBHCOMPSEL_S  8U
#define HRPWM_DCTRIPSEL_DCBHCOMPSEL_M  0xF00U       // Digital Compare B High COMP
                                               // Input Select
#define HRPWM_DCTRIPSEL_DCBLCOMPSEL_S  12U
#define HRPWM_DCTRIPSEL_DCBLCOMPSEL_M  0xF000U      // Digital Compare B Low COMP
                                               // Input Select

//*****************************************************************************
//
// The following are defines for the bit fields in the DCACTL register
//
//*****************************************************************************
#define HRPWM_DCACTL_EVT1SRCSEL   0x1U         // DCAEVT1 Source Signal
#define HRPWM_DCACTL_EVT1FRCSYNCSEL  0x2U         // DCAEVT1 Force Sync Signal
#define HRPWM_DCACTL_EVT1SOCE     0x4U         // DCAEVT1 SOC Enable
#define HRPWM_DCACTL_EVT1SYNCE    0x8U         // DCAEVT1 SYNC Enable
#define HRPWM_DCACTL_EVT2SRCSEL   0x100U       // DCAEVT2 Source Signal
#define HRPWM_DCACTL_EVT2FRCSYNCSEL  0x200U       // DCAEVT2 Force Sync Signal

//*****************************************************************************
//
// The following are defines for the bit fields in the DCBCTL register
//
//*****************************************************************************
#define HRPWM_DCBCTL_EVT1SRCSEL   0x1U         // DCBEVT1 Source Signal
#define HRPWM_DCBCTL_EVT1FRCSYNCSEL  0x2U         // DCBEVT1 Force Sync Signal
#define HRPWM_DCBCTL_EVT1SOCE     0x4U         // DCBEVT1 SOC Enable
#define HRPWM_DCBCTL_EVT1SYNCE    0x8U         // DCBEVT1 SYNC Enable
#define HRPWM_DCBCTL_EVT2SRCSEL   0x100U       // DCBEVT2 Source Signal
#define HRPWM_DCBCTL_EVT2FRCSYNCSEL  0x200U       // DCBEVT2 Force Sync Signal

//*****************************************************************************
//
// The following are defines for the bit fields in the DCFCTL register
//
//*****************************************************************************
#define HRPWM_DCFCTL_SRCSEL_S     0U
#define HRPWM_DCFCTL_SRCSEL_M     0x3U         // Filter Block Signal Source
                                               // Select
#define HRPWM_DCFCTL_BLANKE       0x4U         // Blanking Enable/Disable
#define HRPWM_DCFCTL_BLANKINV     0x8U         // Blanking Window Inversion
#define HRPWM_DCFCTL_PULSESEL_S   4U
#define HRPWM_DCFCTL_PULSESEL_M   0x30U        // Pulse Select for Blanking &
                                               // Capture Alignment
#define HRPWM_DCFCTL_EDGEFILTSEL  0x40U        // Edge Filter Select
#define HRPWM_DCFCTL_EDGEMODE_S   8U
#define HRPWM_DCFCTL_EDGEMODE_M   0x300U       // Edge Mode
#define HRPWM_DCFCTL_EDGECOUNT_S  10U
#define HRPWM_DCFCTL_EDGECOUNT_M  0x1C00U      // Edge Count
#define HRPWM_DCFCTL_EDGESTATUS_S  13U
#define HRPWM_DCFCTL_EDGESTATUS_M  0xE000U      // Edge Status

//*****************************************************************************
//
// The following are defines for the bit fields in the DCCAPCTL register
//
//*****************************************************************************
#define HRPWM_DCCAPCTL_CAPE       0x1U         // Counter Capture Enable
#define HRPWM_DCCAPCTL_SHDWMODE   0x2U         // Counter Capture Mode
#define HRPWM_DCCAPCTL_CAPSTS     0x2000U      // Latched Status Flag for
                                               // Capture Event
#define HRPWM_DCCAPCTL_CAPCLR     0x4000U      // DC Capture Latched Status
                                               // Clear Flag
#define HRPWM_DCCAPCTL_CAPMODE    0x8000U      // Counter Capture Mode

//*****************************************************************************
//
// The following are defines for the bit fields in the DCAHTRIPSEL register
//
//*****************************************************************************
#define HRPWM_DCAHTRIPSEL_TRIPINPUT1  0x1U         // Trip Input 1 Select to DCAH
                                               // Mux
#define HRPWM_DCAHTRIPSEL_TRIPINPUT2  0x2U         // Trip Input 2 Select to DCAH
                                               // Mux
#define HRPWM_DCAHTRIPSEL_TRIPINPUT3  0x4U         // Trip Input 3 Select to DCAH
                                               // Mux
#define HRPWM_DCAHTRIPSEL_TRIPINPUT4  0x8U         // Trip Input 4 Select to DCAH
                                               // Mux
#define HRPWM_DCAHTRIPSEL_TRIPINPUT5  0x10U        // Trip Input 5 Select to DCAH
                                               // Mux
#define HRPWM_DCAHTRIPSEL_TRIPINPUT6  0x20U        // Trip Input 6 Select to DCAH
                                               // Mux
#define HRPWM_DCAHTRIPSEL_TRIPINPUT7  0x40U        // Trip Input 7 Select to DCAH
                                               // Mux
#define HRPWM_DCAHTRIPSEL_TRIPINPUT8  0x80U        // Trip Input 8 Select to DCAH
                                               // Mux
#define HRPWM_DCAHTRIPSEL_TRIPINPUT9  0x100U       // Trip Input 9 Select to DCAH
                                               // Mux
#define HRPWM_DCAHTRIPSEL_TRIPINPUT10  0x200U       // Trip Input 10 Select to DCAH
                                               // Mux
#define HRPWM_DCAHTRIPSEL_TRIPINPUT11  0x400U       // Trip Input 11 Select to DCAH
                                               // Mux
#define HRPWM_DCAHTRIPSEL_TRIPINPUT12  0x800U       // Trip Input 12 Select to DCAH
                                               // Mux
#define HRPWM_DCAHTRIPSEL_TRIPINPUT14  0x2000U      // Trip Input 14 Select to DCAH
                                               // Mux
#define HRPWM_DCAHTRIPSEL_TRIPINPUT15  0x4000U      // Trip Input 15 Select to DCAH
                                               // Mux

//*****************************************************************************
//
// The following are defines for the bit fields in the DCALTRIPSEL register
//
//*****************************************************************************
#define HRPWM_DCALTRIPSEL_TRIPINPUT1  0x1U         // Trip Input 1 Select to DCAL
                                               // Mux
#define HRPWM_DCALTRIPSEL_TRIPINPUT2  0x2U         // Trip Input 2 Select to DCAL
                                               // Mux
#define HRPWM_DCALTRIPSEL_TRIPINPUT3  0x4U         // Trip Input 3 Select to DCAL
                                               // Mux
#define HRPWM_DCALTRIPSEL_TRIPINPUT4  0x8U         // Trip Input 4 Select to DCAL
                                               // Mux
#define HRPWM_DCALTRIPSEL_TRIPINPUT5  0x10U        // Trip Input 5 Select to DCAL
                                               // Mux
#define HRPWM_DCALTRIPSEL_TRIPINPUT6  0x20U        // Trip Input 6 Select to DCAL
                                               // Mux
#define HRPWM_DCALTRIPSEL_TRIPINPUT7  0x40U        // Trip Input 7 Select to DCAL
                                               // Mux
#define HRPWM_DCALTRIPSEL_TRIPINPUT8  0x80U        // Trip Input 8 Select to DCAL
                                               // Mux
#define HRPWM_DCALTRIPSEL_TRIPINPUT9  0x100U       // Trip Input 9 Select to DCAL
                                               // Mux
#define HRPWM_DCALTRIPSEL_TRIPINPUT10  0x200U       // Trip Input 10 Select to DCAL
                                               // Mux
#define HRPWM_DCALTRIPSEL_TRIPINPUT11  0x400U       // Trip Input 11 Select to DCAL
                                               // Mux
#define HRPWM_DCALTRIPSEL_TRIPINPUT12  0x800U       // Trip Input 12 Select to DCAL
                                               // Mux
#define HRPWM_DCALTRIPSEL_TRIPINPUT14  0x2000U      // Trip Input 14 Select to DCAL
                                               // Mux
#define HRPWM_DCALTRIPSEL_TRIPINPUT15  0x4000U      // Trip Input 15 Select to DCAL
                                               // Mux

